; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-25)
 (:domain ferry)
 (:objects 
    car1 car2 car3 - car
    loc1 loc2 loc3 loc4 loc5 loc6 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc1)
    (at car1 loc2)
    (at car2 loc2)
    (at car3 loc6)
)
 (:goal (and 
(at car1 loc4)
(at car2 loc1)
))
)

; plan
1. (sail loc1 loc2)
   deleted: (at-ferry loc1)
   added: (at-ferry loc2)
   goals met: 0 of 2
2. (board car2 loc2)
   deleted: (at car2 loc2) (empty-ferry)
   added: (on car2)
   goals met: 0 of 2
3. (sail loc2 loc1)
   deleted: (at-ferry loc2)
   added: (at-ferry loc1)
   goals met: 0 of 2
4. (debark car2 loc1)
   deleted: (on car2)
   added: (at car2 loc1) (empty-ferry)
   goals met: 1 of 2
5. (sail loc1 loc2)
   deleted: (at-ferry loc1)
   added: (at-ferry loc2)
   goals met: 1 of 2
6. (board car1 loc2)
   deleted: (at car1 loc2) (empty-ferry)
   added: (on car1)
   goals met: 1 of 2
7. (sail loc2 loc4)
   deleted: (at-ferry loc2)
   added: (at-ferry loc4)
   goals met: 1 of 2
8. (debark car1 loc4)
   deleted: (on car1)
   added: (at car1 loc4) (empty-ferry)
   goals met: 2 of 2
